// Имитация государственной базы данных граждан
const govData = [
  { iin: '123456789012', name: 'Ахмет Аманжан Абайулы' },
  { iin: '987654321098', name: 'Онербекова Айганым Мухтаркызы' },
  { iin: '111222333444', name: 'Рустемкызы Айнара Рустемкызы' },
  { iin: '555666777888', name: 'Хитрухин Ярослав Владимирович' },
  { iin: '999888777666', name: 'Кузнецов Алексей Сергеевич' }
];

// Функция поиска гражданина по ИИН
export const findInGovDB = (iin) => {
  return govData.find(user => user.iin === iin);
};
